// Дано число из отрезка [10, 99]. Показать наибольшую цифру числа

Console.WriteLine("Hello, World!");


